src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/CommonModules/НавигаторНоменклатуры/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Навигатор иерархии списков номенклатуры: форма списка, форма выбора и форма подбора (docs/plans/nomenclature-ui.md,
// этапы 2 и 5). Режимы, узлы со счётчиками и отбор узла - в модуле менеджера номенклатуры, здесь - общая работа с
// формой, чтобы три формы не копировали её.
//
// Форма-потребитель держит: реквизиты РежимИерархии, ИзбранныеРежимы, ВидУзла, ЗначениеУзла (savedData), таблицу
// значений УзлыИерархии (Значение, Представление, Количество, Вид), динамический список Список; элементы РежимИерархии
// (поле со списком выбора), КнопкаИзбранныйРежим, КнопкаОбновитьИерархию, УзлыИерархии, Список.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Подготовка формы при создании: запрос списка из модуля менеджера (тот же, что компонует сценарий), режим «Папки».
//
// Параметры:
//  Форма     - ФормаКлиентскогоПриложения - форма со списком номенклатуры
//  ДляВыбора - Булево - форма выбора или подбора: запрос без остатков и цен (ТекстЗапросаВыбора)
//
Процедура ПриСозданииНаСервере(Форма, ДляВыбора = Ложь) Экспорт

	Номенклатура = Справочники.Номенклатура;
	Форма.Список.ТекстЗапроса = ?(ДляВыбора, Номенклатура.ТекстЗапросаВыбора(), Номенклатура.ТекстЗапросаСписка());
	Форма.РежимИерархии = Номенклатура.РежимПапки();

КонецПроцедуры

// Режим иерархии: список режимов (избранные первыми), видимость навигатора, параметр свойства, узлы и отбор узла.
// Режима, которого больше нет (свойство удалено, производство выключено), - «Папки».
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - форма со списком номенклатуры
//  Контекст     - Структура - см. Справочники.Номенклатура.НовыйКонтекстСписка
//  ОтборыПанели - Структура - см. Справочники.Номенклатура.НовыеОтборыПанели
//
Процедура ПрименитьРежим(Форма, Контекст, ОтборыПанели) Экспорт

	Номенклатура = Справочники.Номенклатура;
	Режимы = Номенклатура.РежимыИерархии();
	Если Режимы.НайтиПоЗначению(Форма.РежимИерархии) = Неопределено Тогда
		Форма.РежимИерархии = Номенклатура.РежимПапки();
		Форма.ВидУзла = 0;
	КонецЕсли;
	ЗаполнитьСписокРежимов(Форма, Режимы);
	ЭтоПапки = Номенклатура.ПолеРежимаИерархии(Форма.РежимИерархии) = "";
	Форма.Элементы.УзлыИерархии.Видимость = Не ЭтоПапки;
	Форма.Элементы.КнопкаОбновитьИерархию.Видимость = Не ЭтоПапки;
	Форма.Список.Параметры.УстановитьЗначениеПараметра("СвойствоИерархии",
		Номенклатура.СвойствоРежимаИерархии(Форма.РежимИерархии));
	ОбновитьУзлы(Форма, Контекст, ОтборыПанели);
	ВыбратьУзел(Форма);

КонецПроцедуры

// Узлы навигатора со счётчиками по контексту и фильтрам панели.
//
// Параметры:
//  Форма        - ФормаКлиентскогоПриложения - форма со списком номенклатуры
//  Контекст     - Структура - см. Справочники.Номенклатура.НовыйКонтекстСписка
//  ОтборыПанели - Структура - см. Справочники.Номенклатура.НовыеОтборыПанели
//
Процедура ОбновитьУзлы(Форма, Контекст, ОтборыПанели) Экспорт

	Форма.УзлыИерархии.Загрузить(Справочники.Номенклатура.УзлыИерархии(Форма.РежимИерархии, Контекст, ОтборыПанели));

КонецПроцедуры

// Отбор узла - в группу «Иерархия» отбора списка; узла, которого больше нет, - «Все».
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма со списком номенклатуры
//
Процедура ВыбратьУзел(Форма) Экспорт

	Узлы = Форма.УзлыИерархии;
	Найденные = Узлы.НайтиСтроки(Новый Структура("Вид, Значение", Форма.ВидУзла, Форма.ЗначениеУзла));
	Если Найденные.Количество() = 0 Тогда
		Форма.ВидУзла = 0;
		Форма.ЗначениеУзла = Неопределено;
		Найденные = Узлы.НайтиСтроки(Новый Структура("Вид", 0));
	КонецЕсли;
	Если Найденные.Количество() > 0 Тогда
		Форма.Элементы.УзлыИерархии.ТекущаяСтрока = Найденные[0].ПолучитьИдентификатор();
	КонецЕсли;
	Справочники.Номенклатура.УстановитьОтборИерархии(Форма.Список.Отбор, Форма.РежимИерархии, Форма.ВидУзла,
		Форма.ЗначениеУзла);

КонецПроцедуры

// Добавляет текущий режим в избранные или убирает из них; избранные - первыми в списке выбора режима.
//
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - форма со списком номенклатуры
//
Процедура ПереключитьИзбранныйРежим(Форма) Экспорт

	Избранные = СтрРазделить(Форма.ИзбранныеРежимы, ",", Ложь);
	Позиция = Избранные.Найти(Форма.РежимИерархии);
	Если Позиция = Неопределено Тогда
		Избранные.Добавить(Форма.РежимИерархии);
	Иначе
		Избранные.Удалить(Позиция);
	КонецЕсли;
	Форма.ИзбранныеРежимы = СтрСоединить(Избранные, ",");
	ЗаполнитьСписокРежимов(Форма, Справочники.Номенклатура.РежимыИерархии());

КонецПроцедуры

// Список плоский вне режима «Папки» или при отборе по реквизитам товара: папки отборы не проходят.
//
// Параметры:
//  Форма       - ФормаКлиентскогоПриложения - форма со списком номенклатуры
//  ЕстьОтборПанели - Булево - отбор панели по реквизитам товара
//
Процедура УстановитьОтображение(Форма, ЕстьОтборПанели = Ложь) Экспорт

	Плоский = ЕстьОтборПанели Или Справочники.Номенклатура.ПолеРежимаИерархии(Форма.РежимИерархии) <> "";
	Форма.Элементы.Список.Отображение = ?(Плоский, ОтображениеТаблицы.Список, ОтображениеТаблицы.ИерархическийСписок);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Избранные режимы - первыми в списке выбора; у текущего режима - звёздочка на кнопке.
//
// Параметры:
//  Форма  - ФормаКлиентскогоПриложения - форма со списком номенклатуры
//  Режимы - СписокЗначений - см. Справочники.Номенклатура.РежимыИерархии
//
Процедура ЗаполнитьСписокРежимов(Форма, Режимы)

	Избранные = СтрРазделить(Форма.ИзбранныеРежимы, ",", Ложь);
	Выбор = Форма.Элементы.РежимИерархии.СписокВыбора;
	Выбор.Очистить();
	Для Каждого Режим Из Режимы Цикл
		Если Избранные.Найти(Режим.Значение) <> Неопределено Тогда
			Выбор.Добавить(Режим.Значение, "★ " + Режим.Представление);
		КонецЕсли;
	КонецЦикла;
	Для Каждого Режим Из Режимы Цикл
		Если Избранные.Найти(Режим.Значение) = Неопределено Тогда
			Выбор.Добавить(Режим.Значение, Режим.Представление);
		КонецЕсли;
	КонецЦикла;
	Форма.Элементы.КнопкаИзбранныйРежим.Заголовок = ?(Избранные.Найти(Форма.РежимИерархии) = Неопределено, "☆", "★");

КонецПроцедуры

#КонецОбласти
